# TW1

## Pandas Series and DataFrame

- Practice Pandas Series and DataFrame with examples.

#### Write full names of your team members who worked together.




#### Submission:

- Push the completed code to your Github repository.

In [ ]:
Member: Tong Xu

## Part 0

Practice Pandas Series and DataFrame with the given examples.

In [1]:
import pandas as pd

In [2]:
alist = ['Mouse', 'Giraffe', 'Tiger', 'Dog', 'Hippopotamus', 'Moose', 'Bear']
animals = pd.Series(alist)
animals

0           Mouse
1         Giraffe
2           Tiger
3             Dog
4    Hippopotamus
5           Moose
6            Bear
dtype: object

In [3]:
animals[2]

'Tiger'

In [4]:
animals.iloc[2]

'Tiger'

In [5]:
animals.loc[2]

'Tiger'

In [6]:
s1 = pd.Series(alist, index=[0, 1, 2, 3, 4, 5, 6])
s1

0           Mouse
1         Giraffe
2           Tiger
3             Dog
4    Hippopotamus
5           Moose
6            Bear
dtype: object

In [7]:
s2 = pd.Series(alist, index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
s2

a           Mouse
b         Giraffe
c           Tiger
d             Dog
e    Hippopotamus
f           Moose
g            Bear
dtype: object

In [8]:
s2['c']

'Tiger'

In [9]:
s2.loc['c']

'Tiger'

In [10]:
s2.iloc[2]

'Tiger'

In [11]:
names = ['Chris', 'Kevin', 'Bob', 'Vinod', 'Daniel', 'Fil', 'Stephanie']
owners = pd.Series(names)
owners

0        Chris
1        Kevin
2          Bob
3        Vinod
4       Daniel
5          Fil
6    Stephanie
dtype: object

In [13]:
frame = {'animals': animals, 'owners': owners}

df = pd.DataFrame(frame)

df

        animals     owners
0         Mouse      Chris
1       Giraffe      Kevin
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [14]:
df.columns

Index(['animals', 'owners'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [16]:
type(df['animals'])

pandas.core.series.Series

In [17]:
df.iloc[0]

animals    Mouse
owners     Chris
Name: 0, dtype: object

In [18]:
df.loc[0][1]

'Chris'

In [19]:
# copy an existing DataFrame to create a new dataFrame
copy_df = df.copy()
copy_df

        animals     owners
0         Mouse      Chris
1       Giraffe      Kevin
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [20]:
# drop columns

df2 = df.drop(['owners'], axis = 1)

df2

        animals
0         Mouse
1       Giraffe
2         Tiger
3           Dog
4  Hippopotamus
5         Moose
6          Bear

In [21]:
# drop columns

df3 = df.drop(columns = ['owners'])

df3

        animals
0         Mouse
1       Giraffe
2         Tiger
3           Dog
4  Hippopotamus
5         Moose
6          Bear

In [22]:
# drop rows

df4 = df.drop([0,1])
df4

        animals     owners
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [23]:
midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
                             ['speed', 'weight']],
                     codes=[[0, 0, 1, 1, 2, 2],
                            [0, 1, 0, 1, 0, 1]])

midx

MultiIndex([(  'lama',  'speed'),
            (  'lama', 'weight'),
            (   'cow',  'speed'),
            (   'cow', 'weight'),
            ('falcon',  'speed'),
            ('falcon', 'weight')],
           )

In [24]:
df = pd.DataFrame(index=midx, columns=['big', 'small'],
                   data=[[45, 30], [200, 100], [30, 20], [250, 150], [320, 250],[1, 0.8]])

df

               big  small
lama   speed    45   30.0
       weight  200  100.0
cow    speed    30   20.0
       weight  250  150.0
falcon speed   320  250.0
       weight    1    0.8

In [25]:
df.drop(index='cow', columns='small')

               big
lama   speed    45
       weight  200
falcon speed   320
       weight    1

In [26]:
df.drop(index='weight', level=1)

              big  small
lama   speed   45   30.0
cow    speed   30   20.0
falcon speed  320  250.0

## Part 1 Task 1

Given the data below, implement each tasks. 

<img src="img/df.png" style="height:200px"> 

(1) Create a DataFrame.

(2) Access the first row data and print it.

(3) Access the first column data (indexed by 'dept') and print it.

(4) Create a new DataFrame by dropping the 2nd column data (indexed by 'floor') from the current DataFrame.

In [36]:
alist = ['CS','Bio','Chem','Phy','Eng']
dept = pd.Series(alist)
s1 = pd.Series(alist, index=[0,1,2,3,4])
floors = [5,3,3,2,4]
floor = pd.Series(floors)
frame = {'dept':dept, 'floor':floor}
df = pd.DataFrame(frame)
df

   dept  floor
0    CS      5
1   Bio      3
2  Chem      3
3   Phy      2
4   Eng      4

In [33]:
df.iloc[0]

dept     CS
floor     5
Name: 0, dtype: object

In [34]:
df.loc[0][0]

'CS'

In [35]:
# drop column floor

df2 = df.drop(['floor'], axis = 1)
df2

   dept
0    CS
1   Bio
2  Chem
3   Phy
4   Eng

## Part 1 Task 2

Practice with a data file. 

(1) Choose one data file from the data folder in the given TW1 folder.

(2) Read the data into a DataFrame. 

(3) Access the rows and columns. 

(4) Drop some columns.

In [38]:
cars = pd.read_csv('./data/cars.csv')
print(cars.head())

   YEAR        Make           Model        Size  (kW) Unnamed: 5 TYPE  \
0  2012  MITSUBISHI          i-MiEV  SUBCOMPACT    49         A1    B
1  2012      NISSAN            LEAF    MID-SIZE    80         A1    B
2  2013        FORD  FOCUS ELECTRIC     COMPACT   107         A1    B
3  2013  MITSUBISHI          i-MiEV  SUBCOMPACT    49         A1    B
4  2013      NISSAN            LEAF    MID-SIZE    80         A1    B

   CITY (kWh/100 km)  HWY (kWh/100 km)  COMB (kWh/100 km)  CITY (Le/100 km)  \
0               16.9              21.4               18.7               1.9
1               19.3              23.0               21.1               2.2
2               19.0              21.1               20.0               2.1
3               16.9              21.4               18.7               1.9
4               19.3              23.0               21.1               2.2

   HWY (Le/100 km)  COMB (Le/100 km)  (g/km)  RATING  (km)  TIME (h)
0              2.4               2.1       0     NaN   100         7
1              2.6               2.4       0     NaN   117         7
2              2.4               2.2       0     NaN   122         4
3              2.4               2.1       0     NaN   100         7
4              2.6               2.4       0     NaN   117         7

In [43]:
cars.Make

0     MITSUBISHI
1         NISSAN
2           FORD
3     MITSUBISHI
4         NISSAN
5          SMART
6          SMART
7          TESLA
8          TESLA
9          TESLA
10         TESLA
11     CHEVROLET
12          FORD
13    MITSUBISHI
14        NISSAN
15         SMART
16         SMART
17         TESLA
18         TESLA
19         TESLA
20           BMW
21     CHEVROLET
22          FORD
23           KIA
24    MITSUBISHI
25        NISSAN
26         SMART
27         SMART
28         TESLA
29         TESLA
30         TESLA
31         TESLA
32         TESLA
33         TESLA
34           BMW
35     CHEVROLET
36          FORD
37           KIA
38    MITSUBISHI
39        NISSAN
40        NISSAN
41         SMART
42         SMART
43         TESLA
44         TESLA
45         TESLA
46         TESLA
47         TESLA
48         TESLA
49         TESLA
50         TESLA
51         TESLA
52         TESLA
Name: Make, dtype: object

In [45]:
cars.iloc[0]

YEAR                       2012
Make                 MITSUBISHI
Model                    i-MiEV
Size                 SUBCOMPACT
(kW)                         49
Unnamed: 5                   A1
TYPE                          B
CITY (kWh/100 km)          16.9
HWY (kWh/100 km)           21.4
COMB (kWh/100 km)          18.7
CITY (Le/100 km)            1.9
HWY (Le/100 km)             2.4
COMB (Le/100 km)            2.1
(g/km)                        0
RATING                      NaN
(km)                        100
TIME (h)                      7
Name: 0, dtype: object

In [47]:
cars.iloc[0][1]

'MITSUBISHI'

In [50]:
cars2 = cars.drop(['Make'], axis = 1)
print(cars2.head())

   YEAR           Model        Size  (kW) Unnamed: 5 TYPE  CITY (kWh/100 km)  \
0  2012          i-MiEV  SUBCOMPACT    49         A1    B               16.9
1  2012            LEAF    MID-SIZE    80         A1    B               19.3
2  2013  FOCUS ELECTRIC     COMPACT   107         A1    B               19.0
3  2013          i-MiEV  SUBCOMPACT    49         A1    B               16.9
4  2013            LEAF    MID-SIZE    80         A1    B               19.3

   HWY (kWh/100 km)  COMB (kWh/100 km)  CITY (Le/100 km)  HWY (Le/100 km)  \
0              21.4               18.7               1.9              2.4
1              23.0               21.1               2.2              2.6
2              21.1               20.0               2.1              2.4
3              21.4               18.7               1.9              2.4
4              23.0               21.1               2.2              2.6

   COMB (Le/100 km)  (g/km)  RATING  (km)  TIME (h)
0               2.1       0     NaN   100         7
1               2.4       0     NaN   117         7
2               2.2       0     NaN   122         4
3               2.1       0     NaN   100         7
4               2.4       0     NaN   117         7